Zyx0303/esp32_project/sdkconfig.defaults
# ESP32-S3 机器人控制器配置

# 启用串口输出
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# 启用日志系统
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 设置芯片目标
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ESP32-S3-WROOM-1-N16R8 flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 启用FreeRTOS（双核）
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=n

# BT配置
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLUEDROID_PINNED_TO_CORE_0=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_GATT_MAX_SR_PROFILES=1
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_SMP_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y

# 启用WiFi和BT
CONFIG_ESP_WIFI_ENABLED=y

# 最小化启动日志
CONFIG_BOOTLOADER_LOG_LEVEL=3
CONFIG_ESP_SYSTEM_LOG_LEVEL=3
